doc/main.dot
digraph {
  subgraph { 
    rank = same;
    users [label="users"]
    election
  } 
  community [label="community"]

  community -> users [label="manage"]
  community -> election [label="organise"]
  users -> election [label="vote"]
}
